<template>
  <section class="box">
    <p>{{ name }}</p>
    <p>懸賞金:{{ bounty }}ベリー</p>
    <button @click="bountyUp">懸賞金アップ</button>
  </section>
</template>

<script setup lang="ts">
/**===================================================================================================================
 * 
 ===================================================================================================================**/
//------------------------------------------------------------------------------------------------------------
// 引数
//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
// 定数・変数（state）
//------------------------------------------------------------------------------------------------------------

// 1,子でPropsの準備
// 親から受け取るプロパティはdefineProps()で型宣言
// (1)Propsインターフェース（プロパティ・型）の定義
interface Props {
  id: number;
  name: string;
  bounty: number;
}
// Emits型を定義
type Emits = {
  incrementBounty: [id: number];
};

// (2)definePropsを実行しPropsオブジェクトの設定
const props = defineProps<Props>();
// Emitの設定
const emit = defineEmits<Emits>();

// 値を監視し、変更が検知される状態にする
// const bounty = ref(props.bounty);

// [懸賞金アップ]ボタンをクリックした時のメソッド
const bountyUp = (): void => {
  emit("incrementBounty", props.id);
};

//------------------------------------------------------------------------------------------------------------
// ライフサイクル
//------------------------------------------------------------------------------------------------------------
/*
onBeforeMount(() => {
  //記憶した位置、サイズでの復帰を可能にする
})

onMounted(() => {
  //window.addEventListener('resize', onGetPosition)
})

onBeforeUnmount(() => {
  //window.removeEventListener('resize', onGetPosition)
})
*/
//------------------------------------------------------------------------------------------------------------
//watch
//------------------------------------------------------------------------------------------------------------
/*
watch(
  () => props.value,
  (value) => {
    input.value = value
  }
)
//------------------------------------------------------------------------------------------------------------
//computed
//------------------------------------------------------------------------------------------------------------
/*
const counter: Ref<number> = useState('counter', () => 500)

// computedによりcounter変数の監視が行われる
const doubleCount = computed(() => {
  return counter.value * 2
})
*/
//------------------------------------------------------------------------------------------------------------
// エミット
//------------------------------------------------------------------------------------------------------------
/*
const emits = defineEmits<{ (e: 'update:value', item: any): void }>()
const input = ref(props.value)

function onChange(value: any) {
  input.value = value
  emits('update:value', value)
}
*/

//------------------------------------------------------------------------------------------------------------
// メソッド
//------------------------------------------------------------------------------------------------------------
</script>

<style lang="scss" scoped></style>
