<template>
  <section class="box">
    <p>{{ character.name }}</p>
    <p>懸賞金:{{ character.bounty }}ベリー</p>
    <button @click="bountyUp">懸賞金アップ</button>
  </section>
</template>

<script setup lang="ts">
// 型定義をインポートするときは inport type
import type { Character } from "@/interfaces";
/**===================================================================================================================
 * 
 ===================================================================================================================**/
//------------------------------------------------------------------------------------------------------------
// 引数
//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
// 定数・変数（state）
//------------------------------------------------------------------------------------------------------------

// 1,子でPropsの準備
// 親から受け取るプロパティはdefineProps()で型宣言
// (1)Propsインターフェース（プロパティ・型）の定義
interface Props {
  id: number;
}

// (2)definePropsを実行しPropsオブジェクトの設定
const props = defineProps<Props>();
// キャラクターリストをステートから取得
const characterList = useState<Map<number, Character>>("characterList");

// 該当するキャラを取得
const character = characterList.value.get(props.id) as Character;
// 値を監視し、変更が検知される状態にする
// const bounty = ref(props.bounty);

// [懸賞金アップ]ボタンをクリックした時のメソッド
const bountyUp = (): void => {
  character.bounty += 1000;
};
// 懸賞金の合計の算出プロパティ
const totalBounty = computed((): number => {
  let total = 0;
  for (const character of characterList.value.values()) {
    total += character.bounty;
  }
  return total;
});
//------------------------------------------------------------------------------------------------------------
// ライフサイクル
//------------------------------------------------------------------------------------------------------------
/*
onBeforeMount(() => {
  //記憶した位置、サイズでの復帰を可能にする
})

onMounted(() => {
  //window.addEventListener('resize', onGetPosition)
})

onBeforeUnmount(() => {
  //window.removeEventListener('resize', onGetPosition)
})
*/
//------------------------------------------------------------------------------------------------------------
//watch
//------------------------------------------------------------------------------------------------------------
/*
watch(
  () => props.value,
  (value) => {
    input.value = value
  }
)
//------------------------------------------------------------------------------------------------------------
//computed
//------------------------------------------------------------------------------------------------------------
/*
const counter: Ref<number> = useState('counter', () => 500)

// computedによりcounter変数の監視が行われる
const doubleCount = computed(() => {
  return counter.value * 2
})
*/
//------------------------------------------------------------------------------------------------------------
// エミット
//------------------------------------------------------------------------------------------------------------
/*
const emits = defineEmits<{ (e: 'update:value', item: any): void }>()
const input = ref(props.value)

function onChange(value: any) {
  input.value = value
  emits('update:value', value)
}
*/

//------------------------------------------------------------------------------------------------------------
// メソッド
//------------------------------------------------------------------------------------------------------------
</script>

<style lang="scss" scoped>
.box {
  border: black 5px solid;
  margin: 3px;
  padding: 10px;
}
</style>
